# R как калькулятор -------------------------------------------------------

4 + 4 #addition
1 - 5 #вычитание
6 * 7
9 / 4
9 %/% 4
9 %% 4
6 ^ 2
6 ** 2
2 + 2 * 2
(2 + 2) * 2
36 ^ .5

# Функции -----------------------------------------------------------------


sqrt(36)
sqrt(36)
log(8)
?log
log(x = 8, base = 2)
#log(x = 8, b = 2)
log(8, 2)
log(8, sqrt(4))
#?`+`
#`+`(3, 4)



log(10) * 5
pi
sin(pi)
options(scipen = 999)
sin(pi)
typeof(1/2)

# Присвоение переменных ---------------------------------------------------

# a = 2
a <- 2
a <- log(16, 2^2)
# log(16, 2^2) -> a
# `Словно...;` <- 2

rm(a)
rm(list = ls())
a <- 2
b <- a * a ^ a - a
a == b
a == a
a != b
5!=120
a > b
a < b
a > a
b < b
a >= b
a <= b
a >= a
b <= b
